<?php
/**
 * Created by PhpStorm.
 * User: dongmingcui
 * Date: 2017/11/13
 * Time: 下午3:54
 */

/** 公用代码 **/
$commonCode = [
    10  => '参数不能为空',


];

/** api代码 **/
$apiCode = [
    /** api公用 **/
    100 => '添加成功',
    101 => '修改成功',
    102 => '获取成功',
    103 => '删除成功',

    /** api用户账号相关 **/
    1000 => '账号或密码错误',
    1001 => '注册失败',
    1002 => '只允许一个设备登录',
    1003 => '登录失效',
    1004 => '请登录后操作',
    1005 => '当前用户已在其他设备登陆',
    /** api用户信息相关 **/
    1100 => '',
    1101 => '',
    1102 => '',
    1103 => '',

    /** 验证码相关 **/
    300 =>  '验证成功',
    301 =>  '验证码错误',

];

/** backend代码 */
$backendCode = [

    /** 后台公用 **/
    200 => '添加成功',
    201 => '修改成功',
    202 => '获取成功',
    203 => '删除成功',
    204 => '删除失败',
    205 => '获取失败',
    206 => '添加失败',
    207 => '修改失败',

    /** 后台用户账号相关 **/
    2000 => '账号或密码错误',
    2001 => '注册失败',
    2002 => '账号已经注册',
    2003 => '登录失败',

];

return $commonCode + $backendCode + $apiCode;